tap "altinity/clickhouse"
tap "candid82/brew"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "oven-sh/bun"
tap "qmk/qmk"
tap "ttscoff/thelab"
tap "yqrashawn/goku"
# Code searching, linting, rewriting
brew "ast-grep"
# zplug
brew "zplug"
# starship terminal theme
brew "starship"
#node manager package
brew "fnm"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Library for command-line editing
brew "readline"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Text processing system for reStructuredText
brew "docutils"
# Debian package management system
brew "dpkg"
# View disk space usage and delete unwanted data, fast
brew "dua-cli"
# More intuitive version of du in rust
brew "dust"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# OpenType text shaping engine
brew "harfbuzz"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# macOS CLI for managing custom icons for files and folders
brew "fileicon"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Git extension for versioning large files
brew "git-lfs"
# Audit git repos for secrets
brew "gitleaks"
# Blazing fast terminal-ui for git written in rust
brew "gitui"
# Open-source GitLab command-line tool
brew "glab"
# Render markdown on the CLI
brew "glow"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Library access to GnuPG
brew "gpgme"
# Image processing tools collection
brew "graphicsmagick"
# GNU troff text-formatting system
brew "groff"
# Tool for glamorous shell scripts
brew "gum"
# Free Kerberos 5 implementation
brew "heimdal"
# Process manager for Procfile-based applications
brew "hivemind"
# Get events and tasks from the macOS calendar database
brew "ical-buddy"
# Tool to report network interface bandwidth
brew "ifstat"
# Interactive JSON filter using jq
brew "jnv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Helps you navigate your file system faster by learning your habits
brew "jump"
# Simple terminal UI for git commands
brew "lazygit"
# Conversion library
brew "libiconv"
# Postgres C API library
brew "libpq"
# YAML Parser
brew "libyaml"
# Parsing Expression Grammars For Lua
brew "lpeg"
# Powerful, lightweight programming language
brew "lua"
# Fast, async, resource-friendly link checker
brew "lychee"
# Mac App Store command-line interface
brew "mas"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Install NodeJS versions
brew "node-build"
# Trigger notifications when a process completes
brew "noti"
# Modern shell for the GitHub era
brew "nushell"
# ISO-C API and CLI for generating UUIDs
brew "ossp-uuid"
# Terminal multiplexer
brew "tmux"
# Process manager for Procfile-based applications and tmux
brew "overmind"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Alternative to backtracking PCRE-style regular expression engines
brew "re2"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Prevent committing secret keys into your source code
brew "ripsecrets"
# Collection of tools for managing UNIX services
brew "runit"
# Small command-line utility for adding spacers to command output
brew "spacer"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Modern SSH server for teams managing distributed infrastructure
brew "teleport"
# Simplified and community-driven man pages
brew "tldr"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Syntax-aware linter for prose
brew "vale"
# Secures, stores, and tightly controls access to secrets
brew "vault"
# Internet file retriever
brew "wget"
# Linter for YAML files
brew "yamllint"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# Readability and Markdown utility for saving web urls and HTML text
brew "ttscoff/thelab/gather-cli"
# karabiner configurator
brew "yqrashawn/goku/goku"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Menu bar icon organiser
cask "bartender"
# Utilities designed to make common development tasks easier
cask "devtoys"
# Cross-platform Text Expander written in Rust
cask "espanso"
# Screen colour temperature controller
cask "flux"
# Website and application blocker
cask "focus"
cask "font-cascadia-mono-nf"
cask "font-ia-writer-duo"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-jetbrains-mono-nerd-font"
cask "font-noto-sans-arabic"
cask "font-sf-pro"
# Web browser
cask "brave"
# System monitoring app
cask "istat-menus"
# Host-based application firewall
cask "little-snitch"
# Control your tools with a few keystrokes
cask "raycast"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Pomodoro desktop timer
cask "tomighty"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# View output from scripts in the menu bar
cask "xbar"
